fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Ксения доработка кода
	ВКМ_ДобавитьСозданныеРеквизиты();
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере();	
	// Ксения доработка кода
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// Ксения доработка кода
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания();
	// Ксения доработка кода
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&НаСервере
Процедура ВКМ_ДобавитьСозданныеРеквизиты()

	ВКМ_ГруппаПараметрыОбслуживания = Элементы.Добавить("ВКМ_ГруппаПараметрыОбслуживания", Тип("ГруппаФормы"), ЭтотОбъект);
	ВКМ_ГруппаПараметрыОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображатьЗаголовок = Ложь; // Скрываем технический заголовок
	ВКМ_ГруппаПараметрыОбслуживания.Отображение = ОтображениеОбычнойГруппы.Нет; // Убираем рамку группы
	ВКМ_ГруппаПараметрыОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Красивое горизонтальное оформление периода "Период с [Дата] по [Дата]"
	ВКМ_ГруппаДатаОбслуживания = Элементы.Добавить("ВКМ_ГруппаДатаОбслуживания", Тип("ГруппаФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_ГруппаДатаОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаДатаОбслуживания.ОтображатьЗаголовок = Ложь;
	ВКМ_ГруппаДатаОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	ВКМ_ДекорацияДатаНачала = Элементы.Добавить("ВКМ_ДекорацияДатаНачала", Тип("ДекорацияФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДекорацияДатаНачала.Вид = ВидДекорацииФормы.Надпись;
	ВКМ_ДекорацияДатаНачала.Заголовок = "Период действия обслуживания с:";
	
	ВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ВКМ_ДатаНачалаДействияДоговора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ВКМ_ДекорацияДатаОкончания = Элементы.Добавить("ВКМ_ДекорацияДатаОкончания", Тип("ДекорацияФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДекорацияДатаОкончания.Вид = ВидДекорацииФормы.Надпись;
	ВКМ_ДекорацияДатаОкончания.Заголовок = "по:";
	
	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ВКМ_ДатаОкончанияДействияДоговора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	// Группа для размещения числовых показателей в две колонки (чтобы стояли в один ряд)
	ГруппаКолонки = Элементы.Добавить("ВКМ_ГруппаКолонкиПоказателей", Тип("ГруппаФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ГруппаКолонки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКолонки.ОтображатьЗаголовок = Ложь;
	ГруппаКолонки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаКолонки);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ВКМ_СуммаАбонентскойПлаты.Заголовок = "Абонентская плата";

	ВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаКолонки);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ВКМ_СтоимостьЧасаРаботы.Заголовок = "Стоимость часа";
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере()
	УсловиеВидДоговора = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = УсловиеВидДоговора;
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания()
	УсловиеВидДоговора = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = УсловиеВидДоговора;
КонецПроцедуры

#КонецОбласти
